[{"description":"Create a modern, professional gastronomy benefits platform website with a unique design. The concept: subscription-based platform where users get 2-for-1 deals at partner restaurants. Use a sophisticated color palette with emerald green (#10b981, #059669), coral/orange (#f97316, #ea580c) for appetite appeal, cream/beige (#fef3c7, #fde68a) for elegance, and dark gray (#1f2937, #111827) for professionalism. Design must feel premium, modern, and NOT AI-generated - use creative layouts, asymmetric elements, and sophisticated typography. Include: 1) Hero section with compelling headline about saving money at restaurants, dual CTAs (See Restaurants / View Plans), 2) Benefits section with 4 cards explaining advantages (2-for-1 meals, valid at best restaurants, unlimited experiences, quick ROI), 3) How it works section with 4 interactive steps, 4) Testimonials section with 3 customer reviews, 5) Newsletter signup section, 6) Full navigation with mobile menu. Make it persuasive, conversion-focused, and visually striking. Use modern CSS techniques, smooth animations, and professional spacing. The design should feel like a premium SaaS product, not a template.","type":"feature","passes":true,"id":1},{"description":"Add Restaurants listing page accessible from navigation. Create a sophisticated restaurant catalog with: 1) Hero section with search bar and city selector, 2) Filter sidebar with cuisine type, price range, location, availability checkboxes, 3) Restaurant cards grid showing restaurant image placeholder, name, cuisine type, rating, brief description, location, and View Details button, 4) Add at least 12 sample restaurants with variety of cuisines (Italian, Japanese, Brazilian, French, etc). Use the same emerald/coral color scheme. Make cards interactive with hover effects and smooth transitions. Include pagination at bottom.","type":"feature","passes":true,"id":2},{"description":"Add Subscription Plans page. Create 3 pricing tiers displayed as cards: 1) Monthly Plan (R$ 29.90/month) with basic benefits, 2) Annual Plan (R$ 299/year - Save 16%) with all benefits plus premium perks, 3) Family Plan (R$ 449/year) for up to 4 members. Each card should have: plan name, price prominently displayed, list of included benefits with checkmarks, Subscribe Now button (emerald for recommended plan, outlined for others), highlight the Annual plan as Most Popular with a badge. Add FAQ section below plans addressing common questions. Use persuasive copy emphasizing value and ROI.","type":"feature","passes":true,"id":3},{"description":"Translate entire website to Brazilian Portuguese (PT-BR). Translate all text content including: navigation menu items, hero section headlines and CTAs, benefits section titles and descriptions, how it works steps, testimonials, newsletter section, footer, restaurants page (search placeholder, filter labels, restaurant descriptions, cuisine types), plans page (plan names, benefits lists, FAQ questions and answers, all CTAs). Keep the brand name as is, but translate everything else naturally to Brazilian Portuguese. Maintain the same tone - professional, persuasive, and modern.","type":"feature","passes":true,"id":4},{"description":"Change the brand name throughout the entire website from 'Clube Gourmet' to 'Club Empar'. Update all occurrences including: navbar logo/brand name, page titles, hero section, footer, meta tags, any references in benefits section, testimonials, newsletter, and all other pages (restaurants, plans). Maintain the same design and styling, just replace the name everywhere it appears.","type":"feature","passes":true,"id":5},{"description":"Complete design overhaul to create a truly premium, professional website that doesn't look AI-generated. Remove ALL emoji icons and replace with sophisticated custom SVG icons or modern iconography. Implement: 1) Premium typography hierarchy with proper font weights and letter spacing, 2) Replace emoji-based benefit cards with elegant card designs using custom SVG icons (geometric, minimal, professional), 3) Add sophisticated micro-interactions and transitions, 4) Implement a more refined color system with proper gradients and depth, 5) Use professional photography-style placeholders instead of emoji, 6) Add elegant dividers and section separators, 7) Implement glass morphism effects where appropriate, 8) Create custom illustrations or abstract shapes for visual interest, 9) Refine spacing using professional grid systems, 10) Add subtle texture overlays for depth. The goal: make it look like a $50k+ custom design by a top-tier agency, not a template. Think Stripe, Linear, or Vercel level of design sophistication.","type":"feature","passes":true,"id":6},{"description":"Redesign the restaurants page to be more sophisticated. Replace emoji restaurant images with elegant placeholder cards that use abstract food photography concepts (think minimalist food styling with geometric overlays). Improve the filter sidebar with better visual hierarchy, use proper icons for filters, add smooth filter animations. Make restaurant cards feel premium with better shadows, borders, and hover states. Add a map view toggle option. Implement better typography for restaurant names and descriptions.","type":"feature","passes":true,"id":7},{"description":"Elevate the plans page design. Create pricing cards that feel premium - use subtle gradients, proper depth with shadows, elegant checkmark icons (not basic ones). Add a comparison table view option below cards. Implement smooth toggle between monthly/annual pricing. Make the FAQ section more sophisticated with better accordion animations and icons. Add trust badges that look professional (redesign payment icons, guarantee badges). The pricing section should feel like a premium SaaS product, not a basic subscription page.","type":"feature","passes":true,"id":8},{"description":"Complete redesign inspired by premium enterprise software websites. Apply these principles: 1) BOLD typography with tight tracking (-0.05em), use font weights 700-900, 2) Asymmetric layouts that break the grid intentionally, 3) Dark theme with vibrant accent colors (emerald #00ff88, coral #ff0033, dark background #0a0a0a), 4) Custom cursor effects, 5) 3D hover transforms on cards, 6) Remove all rounded corners or make them very subtle (2px max), 7) Sharp, geometric shapes and dividers, 8) Animated gradient text on headlines, 9) Glass morphism with dark backgrounds, 10) Minimal icons (stroke-based, not filled), 11) Industrial/tech aesthetic not 'friendly' consumer look, 12) Add subtle scanline or grid textures, 13) Unconventional navigation placements, 14) Large impactful numbers/stats, 15) Code-like monospace elements where appropriate. The site should feel cutting-edge, technical, and unique.","type":"feature","passes":true,"id":9},{"description":"Redesign hero section with maximum impact: 1) Split-screen asymmetric layout, 2) Animated gradient text for main headline using vibrant colors, 3) Large bold typography with tight tracking, 4) Remove floating emojis completely, 5) Add geometric shapes (sharp triangles, hexagons) with gradient borders, 6) Implement custom cursor that changes on hover, 7) Add particle effects or grid lines in background, 8) Stats section with large numbers (50%, 15k+, 4.9★) with animated counters, 9) CTAs with hover lift and glow effects, 10) Dark background with subtle texture overlay.","type":"feature","passes":true,"id":10},{"description":"Rebuild benefits and how-it-works sections: 1) Use minimal stroke icons (not filled), 2) Cards with sharp corners and thin borders, 3) Hover effects that lift and add colored shadows, 4) Bold section titles with tight tracking, 5) Remove playful elements, make it sophisticated, 6) Add step numbers in large bold typography for how-it-works, 7) Use monospace font for numbers, 8) Add connecting lines between steps, 9) Implement reveal animations on scroll, 10) Dark cards with gradient borders on hover.","type":"feature","passes":true,"id":11}]